Catalogs/КлассификаторПолномочийМЧД003.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлассификаторПолномочийМЧД003</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйСкрипт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКлассификатора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мнемоника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полномочие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скрипт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТипОтношений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеПолномочия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПодгруппаПолномочия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МнемоникаСистемыВладельцаПолномочия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВключенияПолномочияВКлассификатор</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтзываПолномочия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйСрокДействияДоверенности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьВидимостиПолномочия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоПолученияДоверенностиСДаннымПолномочием</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравоНаВыдачуДоверенностиСДаннымПолномочием</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстПолномочия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правоотношения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыНПА</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автоключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоляДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальноеЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечноеЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Список</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПравилаПроверкиПолномочийМЧД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПравилаПроверкиПолномочийМЧД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Скрипт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоНастроено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиПроверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоляДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальноеЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечноеЗначение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Список</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкиПроверкиРасширенные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МнемоникаПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолномочия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОграничения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОграничения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеОграничения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЗначенияОграничения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЗначенияОграничения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстовоеОписаниеОграничения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСопоставления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторПолномочийМЧД003/Forms/ФормаПодбораСоставныхПолномочий/Ext/Form/Module.bsl
// @strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.ДополнительныеПараметры.Свойство("ПорядковыйНомер", ПорядковыйНомер);
	Параметры.ДополнительныеПараметры.Свойство("Редактирование", Редактирование);
	Параметры.ДополнительныеПараметры.Свойство("СозданиеМЧД", СозданиеМЧД);
	Параметры.ДополнительныеПараметры.Свойство("БезОграничений", БезОграничений);
	
	Если СозданиеМЧД И Не Редактирование Тогда
		ЗаполнитьТекущиеНастройкиПолномочияПоУмолчанию();
	Иначе 
		
		НастройкиТекущегоПравила = Параметры.ДополнительныеПараметры.НастройкиТекущегоПравила;
		Если НастройкиТекущегоПравила.Количество() > 0 Тогда 
			ЗаполнитьТекущиеНастройкиПолномочия(НастройкиТекущегоПравила);
		Иначе
			ЗаполнитьТекущиеНастройкиПолномочияПоУмолчанию();
		КонецЕсли;

	КонецЕсли;
	
	УправлениеФормой();
	
	ЗагрузитьНастройкиВидимостиОграниченийПоПользователю();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность И Не ЗавершениеРаботы Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Выйти без сохранения?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("СпроситьОЗакрытииЗавершение", ЭтотОбъект), ТекстВопроса,
			РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипСуммыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КодОграничения", МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипСуммы());
	ПараметрыОткрытия.Вставить("ИмяЭлемента", Элемент.Имя);
	
	ОткрытьФормуВыбораЗначенияОграничения(ПараметрыОткрытия)

КонецПроцедуры

&НаКлиенте
Процедура ТипВалютыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КодОграничения", МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипВалюты());
	ПараметрыОткрытия.Вставить("ИмяЭлемента", Элемент.Имя);

	ОткрытьФормуВыбораЗначенияОграничения(ПараметрыОткрытия);

КонецПроцедуры

&НаКлиенте
Процедура БезОграниченийПриИзменении(Элемент)
	
	Элементы.ГруппаЗаголовок.Доступность = Не БезОграничений;

КонецПроцедуры

&НаКлиенте
Процедура ПолномочиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("ТолькоПолномочияСОграничениями", Истина);
	
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораПолномочияСОграничением", ЭтотОбъект);
	ОткрытьФорму("Справочник.КлассификаторПолномочийМЧД003.Форма.ФормаВыбора", ПараметрыФормы,
		Элементы.Полномочие, УникальныйИдентификатор, , , ОбработкаВыбора,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура СертификатЭлектроннойПодписиПредставителяНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("УстановитьСерийныйНомерИзЗагружаемогоСертификатаЗавершение", ЭтотОбъект);
	
	ПараметрыЗагрузки = ФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузки.Диалог.Заголовок = НСтр("ru = 'Выберите файл сертификата (только для шифрования)'");
	ПараметрыЗагрузки.Диалог.Фильтр = НСтр("ru = 'Сертификат X.509 (*.cer;*.crt)|*.cer;*.crt'")+ "|"
		+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Все файлы (%1)|%1'"), ПолучитьМаскуВсеФайлы());
	
	ФайловаяСистемаКлиент.ЗагрузитьФайл(ОбработчикЗавершения, ПараметрыЗагрузки);

КонецПроцедуры

&НаКлиенте
Процедура ТипВалютыПриИзменении(Элемент)
	ОбновитьОтметкуНезаполненногоОграниченийПоСумме();
КонецПроцедуры

&НаКлиенте
Процедура ТипСуммыПриИзменении(Элемент)
	ОбновитьОтметкуНезаполненногоОграниченийПоСумме();
КонецПроцедуры

&НаКлиенте
Процедура ЛимитПоСуммеПриИзменении(Элемент)
	ОбновитьОтметкуНезаполненногоОграниченийПоСумме();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОрганВласти

&НаКлиенте
Процедура ОрганВластиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КодОграничения", МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияОрганВласти());
	ПараметрыОткрытия.Вставить("ИмяЭлемента", Элемент.Имя);

	ОткрытьФормуВыбораЗначенияОграничения(ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТерритория

&НаКлиенте
Процедура ТерриторияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
		
	Отказ = Истина;
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КодОграничения", МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТерритория());
	ПараметрыОткрытия.Вставить("ИмяЭлемента", Элемент.Имя);

	ОткрытьФормуВыбораЗначенияОграничения(ПараметрыОткрытия);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидОбязательств

&НаКлиенте
Процедура ВидОбязательствПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
		
	Отказ = Истина;
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КодОграничения", МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияВидОбязательств());
	ПараметрыОткрытия.Вставить("ИмяЭлемента", Элемент.Имя);

	ОткрытьФормуВыбораЗначенияОграничения(ПараметрыОткрытия);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипДокумента

&НаКлиенте
Процедура ТипДокументаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	ОтмеченныеЭлементы = Новый Массив(); // Массив Из Строка
	Для Каждого СтрокаТипДокумента Из ТипДокумента Цикл
		ОтмеченныеЭлементы.Добавить(СтрокаТипДокумента.Код);
	КонецЦикла;
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КодОграничения", МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипДокумента());
	ПараметрыОткрытия.Вставить("ИмяЭлемента", Элемент.Имя);
	ПараметрыОткрытия.Вставить("ОтмеченныеЭлементы", ОтмеченныеЭлементы);
	ПараметрыОткрытия.Вставить("ДоступнаОтметкаНесколькихЗначений", Истина);
	
	ОткрытьФормуВыбораЗначенияОграничения(ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВидыДокументовЭДО

&НаКлиенте
Процедура ВидыДокументовЭДОПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	Если Элемент.ТекущиеДанные <> Неопределено Тогда  
		ПараметрыФормы.Вставить("ТекущаяСтрока", Элемент.ТекущиеДанные.Значение);
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ВидыДокументовЭДО.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВидыДокументовЭДООбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда 
		ВыбранноеЗначение = 
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеЗначение);
	КонецЕсли;
	
	Для Каждого ТекущийВидДокумента Из ВыбранноеЗначение Цикл
	
		НайденноеЗначение = ВидыДокументовЭДО.НайтиПоЗначению(ТекущийВидДокумента);
		Если НайденноеЗначение = Неопределено Тогда
			ВидыДокументовЭДО.Добавить(ТекущийВидДокумента);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ВидыДокументовЭДО.Количество() > 1 Тогда
		Элементы.ВидыДокументовЭДО.ТекущаяСтрока = ВидыДокументовЭДО.Количество() - 1;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокКонтрагентов

&НаКлиенте
Процедура СписокКонтрагентовПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если ОтменаРедактирования Тогда
		СписокКонтрагентов.Удалить(СписокКонтрагентов.Индекс(Элемент.ТекущиеДанные));
		Возврат;
	КонецЕсли;
	
	ИНН = СокрЛП(Элемент.ТекущиеДанные.ИНН); 
	КПП = СокрЛП(Элемент.ТекущиеДанные.КПП);
	
	Если ПустаяСтрока(ИНН) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоЮрЛицо = СтрДлина(СокрЛП(ИНН)) = 10;
	
	Если СозданиеМЧД И Не ЭтоЮрЛицо Тогда
		СообщитьОНесоответствииИННКонтрагента();
		Элемент.ТекущиеДанные.ИНН = "";
		Возврат;
	КонецЕсли;
	
	КоличествоДублейСтрок = 0;
	Для Каждого ТекущаяСтрокаСписка Из СписокКонтрагентов Цикл
		Если СокрЛП(ТекущаяСтрокаСписка.ИНН) = ИНН И СокрЛП(ТекущаяСтрокаСписка.КПП) = КПП Тогда
			КоличествоДублейСтрок = КоличествоДублейСтрок + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоДублейСтрок > 1 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		
		Если ЗначениеЗаполнено(КПП) Тогда
			ТекстСообщения = 
				СтрШаблон(НСтр("ru = 'Строка с ИНН %1 и КПП %2 уже добавлена в табличную часть.'"), ИНН, КПП);
		Иначе
			ТекстСообщения = 
				СтрШаблон(НСтр("ru = 'Строка с ИНН %1 и пустым КПП уже добавлена в табличную часть.'"), ИНН);
		КонецЕсли;
				
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентИННПриИзменении(Элемент)
	
	Если Элемент.Родитель.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.Родитель.ТекущиеДанные.ИспользуетсяКПП = 
		СтрДлина(СокрЛП(Элемент.Родитель.ТекущиеДанные.ИНН)) = 10;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьКонтрагента(Команда)
	
	ПараметрыОтбора = Новый Структура("Наименование, ИНН, КПП", "", "", "");
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПослеВыбораКонтрагента", ЭтотОбъект);
	ИнтеграцияЭДОКлиент.ВыбратьКонтрагента(ПараметрыОтбора, ОповещениеОЗакрытии);

КонецПроцедуры

&НаКлиенте
Процедура ЗакончитьПодбор(Команда)
	
	Отказ = Ложь;
	ПроверитьЗаполнениеПолномочия(Отказ);
	ПроверитьЗаполнениеУсловныхПолей(Отказ);
	ПроверитьЗаполнениеРеквизитовФормы(Отказ);
	
	ОграниченияНеУказаны = ОграниченияНеУказаны();
	Если ОграниченияНеУказаны Тогда
		Отказ = Истина;
		ТекстВопроса = НСтр("ru = 'Добавить полномочие без ограничений?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("СпроситьОДобавленииБезОграниченийЗавершение", ЭтотОбъект), 
			ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	ЗакрытьПодбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТовары(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КодОграничения", МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТовары());
	ПараметрыОткрытия.Вставить("ИмяЭлемента", Элементы.ТоварыРаботыУслуги.Имя);

	ОткрытьФормуВыбораЗначенияОграничения(ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРаботы(Команда)
		
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КодОграничения", МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияРаботы());
	ПараметрыОткрытия.Вставить("ИмяЭлемента", Элементы.ТоварыРаботыУслуги.Имя);

	ОткрытьФормуВыбораЗначенияОграничения(ПараметрыОткрытия);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУслуги(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("КодОграничения", МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияУслуги());
	ПараметрыОткрытия.Вставить("ИмяЭлемента", Элементы.ТоварыРаботыУслуги.Имя);

	ОткрытьФормуВыбораЗначенияОграничения(ПараметрыОткрытия);

КонецПроцедуры

&НаКлиенте
Процедура НастройкиОграничений(Команда)
	
	СписокОтображаемыхОграничений =  Новый СписокЗначений();
	
	СписокОтображаемыхОграничений.Добавить("СтраницаВидОбязательств",
		НСтр("ru = 'Вид обязательств'"), Элементы.Найти("СтраницаВидОбязательств").Видимость);
		
	СписокОтображаемыхОграничений.Добавить("СтраницаТоварыРаботыУслуги",
		НСтр("ru = 'Товары, работы, услуги'"), Элементы.Найти("СтраницаТоварыРаботыУслуги").Видимость);
		
	СписокОтображаемыхОграничений.Добавить("СтраницаТерритория",
		НСтр("ru = 'Территория'"), Элементы.Найти("СтраницаТерритория").Видимость);
		
	СписокОтображаемыхОграничений.Добавить("СтраницаОрганВласти",
		НСтр("ru = 'Орган власти'"), Элементы.Найти("СтраницаОрганВласти").Видимость);
		
	СписокОтображаемыхОграничений.Добавить("СтраницаОбъектТипОбъекта",
		НСтр("ru = 'Объект, тип объекта'"), Элементы.Найти("СтраницаОбъектТипОбъекта").Видимость);
		
	СписокОтображаемыхОграничений.Добавить("СертификатЭлектроннойПодписиПредставителя",
		НСтр("ru = 'Сертификат ЭП представителя'"),
			Элементы.Найти("СертификатЭлектроннойПодписиПредставителя").Видимость);
		
	СписокОтображаемыхОграничений.Добавить("ФилиалДоверителя",
		НСтр("ru = 'Филиал доверителя'"), Элементы.Найти("ФилиалДоверителя").Видимость);
		
	СписокОтображаемыхОграничений.Добавить("СтраницаХарактеристикаУслугиРаботыТовара",
		НСтр("ru = 'Характеристика услуги, работы, товара'"),
			Элементы.Найти("СтраницаХарактеристикаУслугиРаботыТовара").Видимость);
	
	ОповещениеПослеОтметкиОграничений = 
		Новый ОписаниеОповещения("ПослеОтметкиОграничений", ЭтотОбъект);
	
	СписокОтображаемыхОграничений.ПоказатьОтметкуЭлементов(
		ОповещениеПослеОтметкиОграничений, НСтр("ru = 'Доступные ограничения'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Извлекает серийный номер из загружаемого из файла сертификата.
// 
// Параметры:
//  ПомещенныйФайл - Неопределено
//                 - Структура:
//                   * Хранение - Строка
//                   * Имя - Строка
//  ДополнительныеПараметры - Структура
&НаКлиенте
Процедура УстановитьСерийныйНомерИзЗагружаемогоСертификатаЗавершение(ПомещенныйФайл, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ПомещенныйФайл) Тогда
		Возврат;
	КонецЕсли;
	
	АдресСертификата = ПомещенныйФайл.Хранение;
	
	ДанныеСертификата = ПолучитьИзВременногоХранилища(АдресСертификата);
	ЭтоСертификат = ИнтеграцияБСПБЭДВызовСервера.ФайлЯвляетсяСертификатом(ДанныеСертификата);
	Если Не ЭтоСертификат Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Файл сертификата должен быть в формате DER X.509.'"));
		Возврат;
	КонецЕсли;
	
	Сертификат = Новый СертификатКриптографии(ДанныеСертификата);
	СвойстваСертификата = ЭлектроннаяПодписьКлиент.СвойстваСертификата(Сертификат);
	
	СертификатЭлектроннойПодписиПредставителя = Base64Строка(СвойстваСертификата.СерийныйНомер);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиВидимостиОграниченийДляПользователя(Параметры)
	
	ПолноеИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(
		ИмяФормы, "НастройкиВидимостиОграничений", Параметры, , ПолноеИмяПользователя);
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиВидимостиОграниченийПоПользователю()
	
	Если Не СозданиеМЧД Тогда
		Возврат;
	КонецЕсли;
	
	ПолноеИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	
	НастройкиВидимостиОграничений = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(
		ИмяФормы, "НастройкиВидимостиОграничений", , , ПолноеИмяПользователя);
		
	Если Не НастройкиВидимостиОграничений = Неопределено Тогда
		
		Для Каждого ОтмеченныйЭлемент Из НастройкиВидимостиОграничений Цикл
			
			НайденныйЭлемент = Элементы.Найти(ОтмеченныйЭлемент.Значение);
			Если Не НайденныйЭлемент = Неопределено Тогда
				Если ОтмеченныйЭлемент.Значение = "СтраницаВидОбязательств" Тогда
					НайденныйЭлемент.Видимость = ВидОбязательств.Количество() > 0 Или ОтмеченныйЭлемент.Пометка;
				ИначеЕсли ОтмеченныйЭлемент.Значение = "СтраницаТоварыРаботыУслуги" Тогда
					НайденныйЭлемент.Видимость = ТоварыРаботыУслуги.Количество() > 0 Или ОтмеченныйЭлемент.Пометка;
				ИначеЕсли ОтмеченныйЭлемент.Значение = "СтраницаОбъектТипОбъекта" Тогда
					Элементы.СтраницаОбъектТипОбъекта.Видимость = 
						ЗначениеЗаполнено(Объект) Или ЗначениеЗаполнено(ТипОбъекта) Или ОтмеченныйЭлемент.Пометка;
				ИначеЕсли ОтмеченныйЭлемент.Значение = "СтраницаТерритория" Тогда
					НайденныйЭлемент.Видимость = Территория.Количество() > 0 Или ОтмеченныйЭлемент.Пометка;
				ИначеЕсли ОтмеченныйЭлемент.Значение = "СтраницаОрганВласти" Тогда
					НайденныйЭлемент.Видимость = ОрганВласти.Количество() > 0 Или ОтмеченныйЭлемент.Пометка;
				ИначеЕсли ОтмеченныйЭлемент.Значение = "ФилиалДоверителя" Тогда
					Элементы.ФилиалДоверителя.Видимость = ЗначениеЗаполнено(ФилиалДоверителя) Или ОтмеченныйЭлемент.Пометка;
				ИначеЕсли ОтмеченныйЭлемент.Значение = "СертификатЭлектроннойПодписиПредставителя" Тогда
					Элементы.СертификатЭлектроннойПодписиПредставителя.Видимость = 
						ЗначениеЗаполнено(СертификатЭлектроннойПодписиПредставителя) Или ОтмеченныйЭлемент.Пометка;
				ИначеЕсли ОтмеченныйЭлемент.Значение = "СтраницаХарактеристикаУслугиРаботыТовара" Тогда
					НайденныйЭлемент.Видимость = 
						ХарактеристикаУслугиРаботыТовара.Количество() > 0 Или ОтмеченныйЭлемент.Пометка;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗначенияОграничений(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипСуммы() Тогда
		ТипСуммы.Очистить();
		ДобавитьРезультатВыбораВТаблицуОграничения(Результат, ТипСуммы);
	ИначеЕсли ДополнительныеПараметры.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипДокумента() Тогда
		ТипДокумента.Очистить();
		ДобавитьРезультатВыбораВТаблицуОграничения(Результат, ТипДокумента);
	ИначеЕсли ДополнительныеПараметры.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипВалюты() Тогда
		ТипВалюты.Очистить();
		ДобавитьРезультатВыбораВТаблицуОграничения(Результат, ТипВалюты);
	ИначеЕсли ДополнительныеПараметры.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияВидОбязательств() Тогда
		ДобавитьРезультатВыбораВТаблицуОграничения(Результат, ВидОбязательств);
	ИначеЕсли ДополнительныеПараметры.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТовары()
		Или ДополнительныеПараметры.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияРаботы() 
		Или ДополнительныеПараметры.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияУслуги() Тогда
		ДобавитьРезультатВыбораВТаблицуОграничения(Результат, ТоварыРаботыУслуги);
	ИначеЕсли ДополнительныеПараметры.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТерритория() Тогда
		ДобавитьРезультатВыбораВТаблицуОграничения(Результат, Территория);
	ИначеЕсли ДополнительныеПараметры.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияОрганВласти() Тогда
		ДобавитьРезультатВыбораВТаблицуОграничения(Результат, ОрганВласти);
	КонецЕсли;
	
	ОбновитьОтметкуНезаполненногоОграниченийПоСумме();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПолномочияСОграничением(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Полномочие.Очистить();
	
	УстанавливаемоеПолномочие = Полномочие.Добавить();
	УстанавливаемоеПолномочие.Код = Результат.НастройкиТекущегоПравила[0].КодПолномочия;
	УстанавливаемоеПолномочие.Наименование = Результат.НастройкиТекущегоПравила[0].НаименованиеПолномочия;
	УстанавливаемоеПолномочие.Мнемоника = Результат.НастройкиТекущегоПравила[0].МнемоникаПолномочия;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКонтрагента(ВыбранныеЭлементы, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныеЭлементы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ТипЗнч(ВыбранныеЭлементы) = Тип("Массив") Тогда
		ВыбранныеЭлементы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранныеЭлементы);
	КонецЕсли;
	
	ДобавитьКонтрагентов(ВыбранныеЭлементы);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиОграничений(ВыбранныеЭлементы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеЭлементы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ОтмеченныйЭлемент Из ВыбранныеЭлементы Цикл
		НайденныйЭлемент = Элементы.Найти(ОтмеченныйЭлемент.Значение);
		Если Не НайденныйЭлемент = Неопределено Тогда
			НайденныйЭлемент.Видимость = ОтмеченныйЭлемент.Пометка;
		КонецЕсли;
		
		Если Не НайденныйЭлемент.Видимость Тогда
			Если ОтмеченныйЭлемент.Значение = "СтраницаВидОбязательств" Тогда
				ВидОбязательств.Очистить();
			ИначеЕсли ОтмеченныйЭлемент.Значение = "СтраницаТоварыРаботыУслуги" Тогда
				ТоварыРаботыУслуги.Очистить();
			ИначеЕсли ОтмеченныйЭлемент.Значение = "СтраницаОбъектТипОбъекта" Тогда
				Объект = "";
				ТипОбъекта = "";
			ИначеЕсли ОтмеченныйЭлемент.Значение = "СтраницаТерритория" Тогда
				Территория.Очистить();
			ИначеЕсли ОтмеченныйЭлемент.Значение = "СтраницаОрганВласти" Тогда
				ОрганВласти.Очистить();
			ИначеЕсли ОтмеченныйЭлемент.Значение = "ФилиалДоверителя" Тогда
				ФилиалДоверителя = "";
			ИначеЕсли ОтмеченныйЭлемент.Значение = "СертификатЭлектроннойПодписиПредставителя" Тогда
				СертификатЭлектроннойПодписиПредставителя = "";
			ИначеЕсли ОтмеченныйЭлемент.Значение = "СтраницаХарактеристикаУслугиРаботыТовара" Тогда
				ХарактеристикаУслугиРаботыТовара.Очистить();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	СохранитьНастройкиВидимостиОграниченийДляПользователя(ВыбранныеЭлементы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРезультатВыбораВТаблицуОграничения(Результат, ТаблицаОграничения) 
	
	Для Каждого ЗначениеРезультата Из Результат Цикл
		ПараметрыОтбора = Новый Структура("Код", ЗначениеРезультата.Код);
		Если ТаблицаОграничения.НайтиСтроки(ПараметрыОтбора).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы = ТаблицаОграничения.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ЗначениеРезультата); 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораЗначенияОграничения(ПараметрыОткрытия)

	ОткрытьФорму("РегистрСведений.КлассификаторыОграниченийМЧД.Форма.ВыборЗначенияОграниченияПолномочия",
		ПараметрыОткрытия, ЭтотОбъект,,,, 
			Новый ОписаниеОповещения("ПослеВыбораЗначенияОграничений", ЭтотОбъект, ПараметрыОткрытия),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаСервере 
Процедура УправлениеФормой()
	
	Если Не СозданиеМЧД Тогда 
		Элементы.Полномочие.Видимость = Ложь;
		Заголовок = НСтр("ru = 'Настройка правила проверки'");
	КонецЕсли;
	
	Элементы.СтраницаТипыДокументов.Видимость = СозданиеМЧД;
	Элементы.СтраницаВидыДокументовЭДО.Видимость = Не СозданиеМЧД;
	Элементы.НастройкиОграничений.Видимость = СозданиеМЧД;
	Элементы.ГруппаЗаголовок.Доступность = Не БезОграничений;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущиеНастройкиПолномочия(Настройки)
	
	ПолномочиеИзНастройки = 
		Справочники.КлассификаторПолномочийМЧД003.НайтиПоРеквизиту("КодКлассификатора",
			Настройки[0].КодПолномочия);
	
	ЗначенияПолномочияПоУмолчанию = 
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ПолномочиеИзНастройки, "КодКлассификатора, Полномочие, Мнемоника");
			
	НоваяСтрокаПолномочие = Полномочие.Добавить();
	НоваяСтрокаПолномочие.Код = ЗначенияПолномочияПоУмолчанию.КодКлассификатора;
	НоваяСтрокаПолномочие.Наименование = ЗначенияПолномочияПоУмолчанию.Полномочие;
	НоваяСтрокаПолномочие.Мнемоника = ЗначенияПолномочияПоУмолчанию.Мнемоника;
	
	СписокИНН = Новый Массив; //Массив из Строка
	СписокКПП = Новый Массив; //Массив из Строка
	
	Для Каждого ТекущаяНастройка Из Настройки Цикл
		
		Если ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияЛимитПоСумме() Тогда
			
			ЛимитПоСумме = СтроковыеФункцииКлиентСервер.СтрокаВЧисло(ТекущаяНастройка.ТекстовоеОписаниеОграничения);
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияОбъект() Тогда
			
			Объект = СокрЛП(ТекущаяНастройка.ТекстовоеОписаниеОграничения);
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияФилиалДоверителя() Тогда
			
			ФилиалДоверителя = СокрЛП(ТекущаяНастройка.ТекстовоеОписаниеОграничения);
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияСертификатЭППредставителя() Тогда
			
			СертификатЭлектроннойПодписиПредставителя = СокрЛП(ТекущаяНастройка.ТекстовоеОписаниеОграничения);
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипОбъекта() Тогда
			
			ТипОбъекта = СокрЛП(ТекущаяНастройка.ТекстовоеОписаниеОграничения);
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипСуммы() Тогда
			
			ЗаполнитьЗначениеНастройки(ТекущаяНастройка, ТипСуммы);
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипВалюты() Тогда 
			
			ЗаполнитьЗначениеНастройки(ТекущаяНастройка, ТипВалюты);
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияКонтрагент() Тогда 
			
			СписокИНН.Добавить(СокрЛП(ТекущаяНастройка.ТекстовоеОписаниеОграничения));
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = 
			МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияФилиалКонтрагента() Тогда
			
			СписокКПП.Добавить(СокрЛП(ТекущаяНастройка.ТекстовоеОписаниеОграничения)); 
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипДокумента() Тогда
			
			ЗаполнитьЗначениеНастройки(ТекущаяНастройка, ТипДокумента);
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияВидДокументаЭДО() Тогда
			
			ЗаполнитьЗначениеНастройкиВидыДокументовЭДО(ТекущаяНастройка);
		
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияВидОбязательств() Тогда
			
			ЗаполнитьЗначениеНастройки(ТекущаяНастройка, ВидОбязательств);
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТерритория() Тогда
			
			ЗаполнитьЗначениеНастройки(ТекущаяНастройка, Территория);
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияОрганВласти() Тогда
			
			ЗаполнитьЗначениеНастройки(ТекущаяНастройка, ОрганВласти);
			
		ИначеЕсли ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТовары()
			Или ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияУслуги()
			Или ТекущаяНастройка.КодОграничения = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияРаботы() Тогда
			
				ЗаполнитьЗначениеНастройки(ТекущаяНастройка, ТоварыРаботыУслуги);
				
		ИначеЕсли ТекущаяНастройка.КодОграничения = 
			МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияХарактеристикаУслугиРаботыТовара() Тогда
			
				СтрокаТаблицы = ХарактеристикаУслугиРаботыТовара.Добавить();
				СтрокаТаблицы.Код = СокрЛП(ТекущаяНастройка.ТекстовоеОписаниеОграничения);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьКонтрагентов(СписокИНН, СписокКПП);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущиеНастройкиПолномочияПоУмолчанию()
	
	ПолномочиеПоУмолчанию = 
		Справочники.КлассификаторПолномочийМЧД003.НайтиПоРеквизиту("КодКлассификатора",
			Справочники.КлассификаторПолномочийМЧД003.КодПолномочия_KLASS_2_0_SIGN_ELECTRONIC_DOCUMENTS());
	
	ЗначенияПолномочияПоУмолчанию = 
		ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ПолномочиеПоУмолчанию, "КодКлассификатора, Полномочие, Мнемоника");
			
	НоваяСтрокаПолномочие = Полномочие.Добавить();
	НоваяСтрокаПолномочие.Код = ЗначенияПолномочияПоУмолчанию.КодКлассификатора;
	НоваяСтрокаПолномочие.Наименование = ЗначенияПолномочияПоУмолчанию.Полномочие;
	НоваяСтрокаПолномочие.Мнемоника = ЗначенияПолномочияПоУмолчанию.Мнемоника;
	
	КлассификаторЗначенийОграничений = РегистрыСведений.КлассификаторыОграниченийМЧД.КлассификаторЗначенийОграничений();
	
	ЗначениеОграниченияТипВалюты = 
		КлассификаторЗначенийОграничений.Найти(МашиночитаемыеДоверенности.КодыПоддерживаемыхВалют()[0], "Код");
	
	НоваяСтрокаТипВалюты = ТипВалюты.Добавить();
	НоваяСтрокаТипВалюты.Код = ЗначениеОграниченияТипВалюты.Код;
	НоваяСтрокаТипВалюты.Наименование = ЗначениеОграниченияТипВалюты.Наименование;
	
	ЗначениеОграниченияТипСуммы = 
		КлассификаторЗначенийОграничений.Найти(МашиночитаемыеДоверенности.КодЗначенияОграниченияТипСуммыСНДС(), "Код");
	
	НоваяСтрокаТипСуммы = ТипСуммы.Добавить();
	НоваяСтрокаТипСуммы.Код = ЗначениеОграниченияТипСуммы.Код;
	НоваяСтрокаТипСуммы.Наименование = ЗначениеОграниченияТипСуммы.Наименование;
	
	Если СозданиеМЧД И Не Редактирование Тогда

		ЗначениеОграниченияТипДокумента = КлассификаторЗначенийОграничений.Найти(
			МашиночитаемыеДоверенности.КодЗначенияОграниченияТипДокументаУПД(), "Код");

		НоваяСтрокаТипДокумента = ТипДокумента.Добавить();
		НоваяСтрокаТипДокумента.Код = ЗначениеОграниченияТипДокумента.Код;
		НоваяСтрокаТипДокумента.Наименование = ЗначениеОграниченияТипДокумента.Наименование;

	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначениеНастройки(Настройка, Таблица)

	ПараметрыОтбора = Новый Структура("Код", Настройка.КодЗначенияОграничения);
	Значение = Таблица.НайтиСтроки(ПараметрыОтбора);
	
	Если Значение.Количество() = 0 Тогда 
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Код = Настройка.КодЗначенияОграничения;
		НоваяСтрока.Наименование = Настройка.НаименованиеЗначенияОграничения;
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначениеНастройкиВидыДокументовЭДО(Настройка)
	
	ВидДокументаЭДО = Настройка.ОбъектСопоставления;
	
	Если Не ЗначениеЗаполнено(ВидДокументаЭДО) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементСписка = ВидыДокументовЭДО.НайтиПоЗначению(ВидДокументаЭДО);
	
	Если ЭлементСписка = Неопределено Тогда
		ВидыДокументовЭДО.Добавить(ВидДокументаЭДО);
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКонтрагентов(Контрагенты)

	ИННКонтрагента = ЭлектронноеВзаимодействие.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННКонтрагента");
	КППКонтрагента = ЭлектронноеВзаимодействие.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("КППКонтрагента");
	ПредставлениеКонтрагента = ЭлектронноеВзаимодействие.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("НаименованиеКонтрагентаДляСообщенияПользователю");

	МассивРеквизитов = Новый Массив(); // Массив Из Строка
	МассивРеквизитов.Добавить(ИННКонтрагента);
	МассивРеквизитов.Добавить(КППКонтрагента);
	МассивРеквизитов.Добавить(ПредставлениеКонтрагента);
	
	ЗначенияРеквизитовКонтрагентов = 
		ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Контрагенты, СтрСоединить(МассивРеквизитов, ","));
	
	Для Каждого Элемент Из ЗначенияРеквизитовКонтрагентов Цикл
		
		ЭтоЮрЛицо = СтрДлина(СокрЛП(Элемент.Значение[ИННКонтрагента])) = 10;
		
		Если СозданиеМЧД И Не ЭтоЮрЛицо Тогда
			ТекстОшибки = НСтр("ru='ИНН контрагента может принимать значение только в соответствии с ИНН юридического лица';");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			Продолжить;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("ИНН, КПП", "", "");
		ПараметрыОтбора.ИНН = Элемент.Значение[ИННКонтрагента];
		ПараметрыОтбора.КПП = Элемент.Значение[КППКонтрагента];

		НайденныеЭлементы = СписокКонтрагентов.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеЭлементы.Количество() = 0 Тогда
			НоваяСтрока = СписокКонтрагентов.Добавить();
			НоваяСтрока.ИНН = Элемент.Значение[ИННКонтрагента];
			НоваяСтрока.КПП = Элемент.Значение[КППКонтрагента];
			НоваяСтрока.Представление = Элемент.Значение[ПредставлениеКонтрагента];
			НоваяСтрока.ИспользуетсяКПП = СтрДлина(СокрЛП(НоваяСтрока.ИНН)) = 10;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьОНесоответствииИННКонтрагента()
	ТекстОшибки = НСтр("ru='ИНН контрагента может принимать значение только в соответствии с ИНН юридического лица';");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеПолномочия(Отказ)
	
	Если Полномочие.Количество() = 0 Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для продолжения укажите полномочие.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеУсловныхПолей(Отказ)
	
	Если БезОграничений Тогда 
		Возврат;
	КонецЕсли;
	
	НеобходимоЗаполнитьТипВалюты = ЗначениеЗаполнено(ЛимитПоСумме) И Не ЗначениеЗаполнено(ТипВалюты);
	НеобходимоЗаполнитьТипСуммы = ЗначениеЗаполнено(ЛимитПоСумме) И Не ЗначениеЗаполнено(ТипСуммы);
	
	ОбновитьОтметкуНезаполненногоОграниченийПоСумме();
	
	Если НеобходимоЗаполнитьТипВалюты И НеобходимоЗаполнитьТипСуммы Тогда
		ТекстСообщения = НСтр("ru='При указании лимита по сумме также необходимо указать тип валюты и тип суммы.';");
			ПоказатьПредупреждение(, ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НеобходимоЗаполнитьТипВалюты Тогда
			ТекстСообщения = НСтр("ru='При указании лимита по сумме также необходимо указать тип валюты.';");
			ПоказатьПредупреждение(, ТекстСообщения);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НеобходимоЗаполнитьТипСуммы Тогда
			ТекстСообщения = НСтр("ru='При указании лимита по сумме также необходимо указать тип суммы.';");
			ПоказатьПредупреждение(, ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеРеквизитовФормы(Отказ)
	
	Если БезОграничений Тогда
		Возврат;
	КонецЕсли;
	
	СписокОшибок = Новый Массив; //Массив из Строка
	ПроверитьЗаполнениеРеквизитаСписокКонтрагентов(СписокОшибок);
	
	ТекстСообщения = СтрСоединить(СписокОшибок, Символы.ПС);
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеРеквизитаСписокКонтрагентов(СписокОшибок)
	
	НайденныеСтроки = СписокКонтрагентов.НайтиСтроки(Новый Структура("ИНН",""));
	
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		
		ТекущийНомерСтроки = СписокКонтрагентов.Индекс(ТекущаяСтрока) + 1;
		
		ШаблонОшибки = НСтр("ru = 'В строке %1 табличной части ""%2"" не заполнен ИНН.'");
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийНомерСтроки, Элементы.СписокКонтрагентов.Заголовок);
		
		СписокОшибок.Добавить(ТекстОшибки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьПараметрыЗаписиПередЗакрытием(ПараметрыЗаписи)
	
	ПараметрыЗаписи.ПорядковыйНомер = ПорядковыйНомер;
	ПараметрыЗаписи.Редактирование = Редактирование;
	
	УстанавливаемоеПолномочие = 
		Справочники.КлассификаторПолномочийМЧД003.ПолучитьДанныеПолномочия_KLASS_2_0_SIGN_ELECTRONIC_DOCUMENTS();
	
	ДанныеОграничений = 
		Справочники.КлассификаторПолномочийМЧД003.ПолучитьДанныеПоддерживаемыхОграниченийИзКлассификатора();
	
	Если СозданиеМЧД И Полномочие.Количество() > 0 Тогда
			
		ПолномочиеИзНастройки = 
			Справочники.КлассификаторПолномочийМЧД003.НайтиПоРеквизиту("КодКлассификатора", Полномочие[0].Код);
	
		Если ЗначениеЗаполнено(ПолномочиеИзНастройки) Тогда
			УстанавливаемоеПолномочие = 
				ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					ПолномочиеИзНастройки, 
						"КодКлассификатора, Полномочие, Мнемоника, ОписаниеПолномочия, КонтекстПолномочия");
		КонецЕсли;
	КонецЕсли;
	
	НомерОграничения = 1;
	ПодготовленноеПравило = Новый Массив; //массив из Структура
	НастройкиПравила = МашиночитаемыеДоверенностиКлиентСервер.НовыйНастройкиПроверкиРасширенные();
	
	Если БезОграничений Тогда 
		
		НастройкиПравила = 
			Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
				УстанавливаемоеПолномочие, НомерОграничения, Неопределено, Неопределено);
				
		ПодготовленноеПравило.Добавить(НастройкиПравила);
		
	Иначе
		
		Для Каждого ТекущееЗначение Из ТипДокумента Цикл 
			
			Ограничение = ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипДокумента());
			
			ЗначениеОграничения = Новый Структура;
			ЗначениеОграничения.Вставить("КодЗначенияОграничения", ТекущееЗначение.Код); 
			ЗначениеОграничения.Вставить("НаименованиеЗначенияОграничения" , ТекущееЗначение.Наименование);
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, ЗначениеОграничения);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЦикла;
		
		УникальныеЗначенияВидДокументовЭДО = ОбщегоНазначенияКлиентСервер.СвернутьМассив(
			ВидыДокументовЭДО.ВыгрузитьЗначения());

		Для Каждого ТекущийВидДокумента Из УникальныеЗначенияВидДокументовЭДО Цикл

			ОграничениеВидДокументаЭДО = Справочники.КлассификаторПолномочийМЧД003.ОграничениеВидДокументаЭДО();

			НастройкиПравила = Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(
				ПорядковыйНомер, УстанавливаемоеПолномочие, НомерОграничения, ОграничениеВидДокументаЭДО, , ,
				ТекущийВидДокумента);

			ПодготовленноеПравило.Добавить(НастройкиПравила);

			НомерОграничения = НомерОграничения + 1;

		КонецЦикла;
		
		Если ЗначениеЗаполнено(ЛимитПоСумме) Тогда 
			
			ТекстовоеОписаниеОграничения = Строка(ЛимитПоСумме);
			Ограничение = ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияЛимитПоСумме());
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, Неопределено, ТекстовоеОписаниеОграничения);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ФилиалДоверителя) Тогда 
			
			ТекстовоеОписаниеОграничения = Строка(ФилиалДоверителя);
			Ограничение = 
				ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияФилиалДоверителя());
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, Неопределено, ТекстовоеОписаниеОграничения);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СертификатЭлектроннойПодписиПредставителя) Тогда 
			
			ТекстовоеОписаниеОграничения = Строка(СертификатЭлектроннойПодписиПредставителя);
			Ограничение = 
				ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияСертификатЭППредставителя());
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, Неопределено, ТекстовоеОписаниеОграничения);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект) Тогда 
			
			ТекстовоеОписаниеОграничения = СокрЛП(Объект);
			Ограничение = ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияОбъект());
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, Неопределено, ТекстовоеОписаниеОграничения);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТипОбъекта) Тогда 
			
			ТекстовоеОписаниеОграничения = СокрЛП(ТипОбъекта);
			Ограничение = ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипОбъекта());
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, Неопределено, ТекстовоеОписаниеОграничения);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЕсли;
		
		Для Каждого ТекущееЗначение Из ТипСуммы Цикл 
			
			Ограничение = ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипСуммы());
			
			ЗначениеОграничения = Новый Структура;
			ЗначениеОграничения.Вставить("КодЗначенияОграничения", ТекущееЗначение.Код); 
			ЗначениеОграничения.Вставить("НаименованиеЗначенияОграничения" , ТекущееЗначение.Наименование);	
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, ЗначениеОграничения);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЦикла;
		
		Для Каждого ТекущееЗначение Из ТипВалюты Цикл 
			
			Ограничение = ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТипВалюты());
			
			ЗначениеОграничения = Новый Структура;
			ЗначениеОграничения.Вставить("КодЗначенияОграничения", ТекущееЗначение.Код); 
			ЗначениеОграничения.Вставить("НаименованиеЗначенияОграничения" , ТекущееЗначение.Наименование);	
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, ЗначениеОграничения);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЦикла;
		
		Для Каждого ТекущееЗначение Из ВидОбязательств Цикл 
			
			Ограничение = ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияВидОбязательств());
			
			ЗначениеОграничения = Новый Структура;
			ЗначениеОграничения.Вставить("КодЗначенияОграничения", ТекущееЗначение.Код); 
			ЗначениеОграничения.Вставить("НаименованиеЗначенияОграничения" , ТекущееЗначение.Наименование);	
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, ЗначениеОграничения);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЦикла;
		
		Для Каждого ТекущееЗначение Из Территория Цикл 
			
			Ограничение = ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТерритория());
			
			ЗначениеОграничения = Новый Структура;
			ЗначениеОграничения.Вставить("КодЗначенияОграничения", ТекущееЗначение.Код); 
			ЗначениеОграничения.Вставить("НаименованиеЗначенияОграничения" , ТекущееЗначение.Наименование);	
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, ЗначениеОграничения);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЦикла;
		
		Для Каждого ТекущееЗначение Из ОрганВласти Цикл 
			
			Ограничение = ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияОрганВласти());
			
			ЗначениеОграничения = Новый Структура;
			ЗначениеОграничения.Вставить("КодЗначенияОграничения", ТекущееЗначение.Код); 
			ЗначениеОграничения.Вставить("НаименованиеЗначенияОграничения" , ТекущееЗначение.Наименование);
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, ЗначениеОграничения);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЦикла;
		
		Для Каждого ТекущееЗначение Из ТоварыРаботыУслуги Цикл 
			
			КодОграниченияТовары = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияТовары();
			КодОграниченияУслуги = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияУслуги();
			КодОграниченияРаботы = МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияРаботы();
			
			Ограничение = ДанныеОграничений.Получить(КодОграниченияТовары);
			
			Если СтрНачинаетсяС(ТекущееЗначение.Код, КодОграниченияУслуги) Тогда
				Ограничение = ДанныеОграничений.Получить(КодОграниченияУслуги);
			ИначеЕсли СтрНачинаетсяС(ТекущееЗначение.Код, КодОграниченияРаботы) Тогда
				Ограничение = ДанныеОграничений.Получить(КодОграниченияРаботы);
			КонецЕсли;
			
			ЗначениеОграничения = Новый Структура;
			ЗначениеОграничения.Вставить("КодЗначенияОграничения", ТекущееЗначение.Код); 
			ЗначениеОграничения.Вставить("НаименованиеЗначенияОграничения" , ТекущееЗначение.Наименование);
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, ЗначениеОграничения);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЦикла;
		
		Для Каждого Значение Из СписокКонтрагентов Цикл
			
			Ограничение = ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияКонтрагент());
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, Неопределено, Значение.ИНН);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЦикла;
		
		Для Каждого Значение Из СписокКонтрагентов Цикл
			
			Ограничение = ДанныеОграничений.Получить(МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияФилиалКонтрагента());
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, Неопределено, Значение.КПП);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЦикла;
		
		Для Каждого Значение Из ХарактеристикаУслугиРаботыТовара Цикл
			
			Ограничение = ДанныеОграничений.Получить(
				МашиночитаемыеДоверенностиКлиентСервер.КодОграниченияХарактеристикаУслугиРаботыТовара());
			
			НастройкиПравила = 
				Справочники.ПравилаПроверкиПолномочийМЧД.ПолучитьНастройкиПроверкиРасширенные(ПорядковыйНомер, 
					УстанавливаемоеПолномочие, НомерОграничения, Ограничение, Неопределено, Значение.Код);
			
			ПодготовленноеПравило.Добавить(НастройкиПравила);
			
			НомерОграничения = НомерОграничения + 1;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	ПараметрыЗаписи.НастройкиТекущегоПравила = ПодготовленноеПравило;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКонтрагентов(СписокИНН, СписокКПП)
	
	МашиночитаемыеДоверенности.ЗаполнитьСписокКонтрагентов(СписокКонтрагентов, СписокИНН, СписокКПП);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтметкуНезаполненногоОграниченийПоСумме()
	
	Элементы.ТипВалюты.ОтметкаНезаполненного = ЗначениеЗаполнено(ЛимитПоСумме) И Не ЗначениеЗаполнено(ТипВалюты);
	Элементы.ТипСуммы.ОтметкаНезаполненного = ЗначениеЗаполнено(ЛимитПоСумме) И Не ЗначениеЗаполнено(ТипСуммы);
	
КонецПроцедуры

&НаКлиенте
Функция ОграниченияНеУказаны()
	
	Возврат Не ЗначениеЗаполнено(ВидыДокументовЭДО)
		И Не ЗначениеЗаполнено(ВидОбязательств)
		И Не ЗначениеЗаполнено(ЛимитПоСумме)
		И Не ЗначениеЗаполнено(Объект)
		И Не ЗначениеЗаполнено(ОрганВласти)
		И Не ЗначениеЗаполнено(СертификатЭлектроннойПодписиПредставителя)
		И Не ЗначениеЗаполнено(СписокКонтрагентов)
		И Не ЗначениеЗаполнено(Территория)
		И Не ЗначениеЗаполнено(ТипВалюты)
		И Не ЗначениеЗаполнено(ТипДокумента)
		И Не ЗначениеЗаполнено(ТипОбъекта)
		И Не ЗначениеЗаполнено(ТипСуммы)
		И Не ЗначениеЗаполнено(ТоварыРаботыУслуги)
		И Не ЗначениеЗаполнено(ФилиалДоверителя)
		И Не ЗначениеЗаполнено(ХарактеристикаУслугиРаботыТовара);
		
КонецФункции

// Параметры:
//  Результат - КодВозвратаДиалога
//  Параметры - Структура,
// 			  - Неопределено
&НаКлиенте
Процедура СпроситьОДобавленииБезОграниченийЗавершение(Результат, Параметры) Экспорт

	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	БезОграничений = Истина;
	Элементы.ГруппаЗаголовок.Доступность = Не БезОграничений;
	
	ЗакрытьПодбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПодбор()
	
	ПараметрыЗаписи = МашиночитаемыеДоверенностиКлиент.НовыйПараметрыОткрытияФормыРедактированияПолномочий();
	ПодготовитьПараметрыЗаписиПередЗакрытием(ПараметрыЗаписи);
	
	Модифицированность = Ложь;
	
	Закрыть(ПараметрыЗаписи);
	
КонецПроцедуры

// Параметры:
//  Ответ - КодВозвратаДиалога
//  ДополнительныеПараметры - Неопределено
&НаКлиенте
Процедура СпроситьОЗакрытииЗавершение(Ответ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
